# Pandas

In [53]:
import pandas as pd
import numpy as np
import string

## Data Frame

In [54]:
df = pd.DataFrame({
  'id': range(5),
  'heigth': [1.7, 1.7, 1.8, 1.9, 2.0],
  'weight': [70 , 73 , 80 , 100, 95]
})
df

   id  heigth  weight
0   0     1.7      70
1   1     1.7      73
2   2     1.8      80
3   3     1.9     100
4   4     2.0      95

In [55]:
df['bmi'] = df.weight / (df.heigth)**2
df

   id  heigth  weight        bmi
0   0     1.7      70  24.221453
1   1     1.7      73  25.259516
2   2     1.8      80  24.691358
3   3     1.9     100  27.700831
4   4     2.0      95  23.750000

In [56]:
# https://www.geeksforgeeks.org/python-change-column-names-and-row-indexes-in-pandas-dataframe/?ref=rp

idx = df.columns
new_colnames = idx.str.upper()
new_colnames
# df.columns = new_colnames

Index(['ID', 'HEIGTH', 'WEIGHT', 'BMI'], dtype='object')

Rename columns with a function. The `rename` method is a method that does not mute the current data frame, but outputs the modified version.

In [57]:
tb_2 = df.rename(columns = lambda x: x.title())
tb_2

   Id  Heigth  Weight        Bmi
0   0     1.7      70  24.221453
1   1     1.7      73  25.259516
2   2     1.8      80  24.691358
3   3     1.9     100  27.700831
4   4     2.0      95  23.750000

Select and reorder columns:

In [58]:
tb_3 = df.reindex(['id', 'bmi', 'weight'], axis=1)
tb_3

   id        bmi  weight
0   0  24.221453      70
1   1  25.259516      73
2   2  24.691358      80
3   3  27.700831     100
4   4  23.750000      95

The same concepts can be applied to row names:

In [59]:
# row names
df.index

RangeIndex(start=0, stop=5, step=1)

In [60]:
# row's rename
df.rename(index = lambda x: "row-" + str(x))

       id  heigth  weight        bmi
row-0   0     1.7      70  24.221453
row-1   1     1.7      73  25.259516
row-2   2     1.8      80  24.691358
row-3   3     1.9     100  27.700831
row-4   4     2.0      95  23.750000

Select rows by their name.

In [61]:
# Select rows by their name.
df.reindex([1, 3, 4], axis=0)

   id  heigth  weight        bmi
1   1     1.7      73  25.259516
3   3     1.9     100  27.700831
4   4     2.0      95  23.750000

## Data Import

### Read a csv file

CSV: comma separated values file. The first row contains the column names:

In [62]:
%%bash
head data/dc-wikia-data.csv

page_id,name,urlslug,ID,ALIGN,EYE,HAIR,SEX,GSM,ALIVE,APPEARANCES,FIRST APPEARANCE,YEAR
1422,Batman (Bruce Wayne),\/wiki\/Batman_(Bruce_Wayne),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,,Living Characters,3093,"1939, May",1939
23387,Superman (Clark Kent),\/wiki\/Superman_(Clark_Kent),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,,Living Characters,2496,"1986, October",1986
1458,Green Lantern (Hal Jordan),\/wiki\/Green_Lantern_(Hal_Jordan),Secret Identity,Good Characters,Brown Eyes,Brown Hair,Male Characters,,Living Characters,1565,"1959, October",1959
1659,James Gordon (New Earth),\/wiki\/James_Gordon_(New_Earth),Public Identity,Good Characters,Brown Eyes,White Hair,Male Characters,,Living Characters,1316,"1987, February",1987
1576,Richard Grayson (New Earth),\/wiki\/Richard_Grayson_(New_Earth),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,,Living Characters,1237,"1940, April",1940
1448,Wonder Woman (Diana Prince),\/wiki\/Wonder_Woman_(Diana_Prince),Public Identity,Good Characters,Blue Eyes,Black Hair,Female Characters,,Living Characters,1231,"1941, December",1941
1486,Aquaman (Arthur Curry),\/wiki\/Aquaman_(Arthur_Curry),Public Identity,Good Characters,Blue Eyes,Blond Hair,Male Characters,,Living Characters,1121,"1941, November",1941
1451,Timothy Drake (New Earth),\/wiki\/Timothy_Drake_(New_Earth),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,,Living Characters,1095,"1989, August",1989
71760,Dinah Laurel Lance (New Earth),\/wiki\/Dinah_Laurel_Lance_(New_Earth),Public Identity,Good Characters,Blue Eyes,Blond Hair,Female Characters,,Living Characters,1075,"1969, November",1969

Read a csv with a standard separator (`,`):

In [63]:
dc = pd.read_csv('data/dc-wikia-data.csv')
dc

,page_id,name,urlslug,ID,ALIGN,EYE,HAIR,SEX,GSM,ALIVE,APPEARANCES,FIRST APPEARANCE,YEAR
0,1422,Batman (Bruce Wayne),\/wiki\/Batman_(Bruce_Wayne),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,3093.0,"1939, May",1939.0
1,23387,Superman (Clark Kent),\/wiki\/Superman_(Clark_Kent),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,2496.0,"1986, October",1986.0
2,1458,Green Lantern (Hal Jordan),\/wiki\/Green_Lantern_(Hal_Jordan),Secret Identity,Good Characters,Brown Eyes,Brown Hair,Male Characters,NaN,Living Characters,1565.0,"1959, October",1959.0
3,1659,James Gordon (New Earth),\/wiki\/James_Gordon_(New_Earth),Public Identity,Good Characters,Brown Eyes,White Hair,Male Characters,NaN,Living Characters,1316.0,"1987, February",1987.0
4,1576,Richard Grayson (New Earth),\/wiki\/Richard_Grayson_(New_Earth),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,1237.0,"1940, April",1940.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6891,66302,Nadine West (New Earth),\/wiki\/Nadine_West_(New_Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,NaN,Living Characters,NaN,NaN,NaN
6892,283475,Warren Harding (New Earth),\/wiki\/Warren_Harding_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6893,283478,William Harrison (New Earth),\/wiki\/William_Harrison_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6894,283471,William McKinley (New Earth),\/wiki\/William_McKinley_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6895,150660,Mookie (New Earth),\/wiki\/Mookie_(New_Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,NaN,Living Characters,NaN,NaN,NaN

Or specifing the separator

In [64]:
dc = pd.read_table('data/dc-wikia-data.csv', sep=',')
dc

,page_id,name,urlslug,ID,ALIGN,EYE,HAIR,SEX,GSM,ALIVE,APPEARANCES,FIRST APPEARANCE,YEAR
0,1422,Batman (Bruce Wayne),\/wiki\/Batman_(Bruce_Wayne),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,3093.0,"1939, May",1939.0
1,23387,Superman (Clark Kent),\/wiki\/Superman_(Clark_Kent),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,2496.0,"1986, October",1986.0
2,1458,Green Lantern (Hal Jordan),\/wiki\/Green_Lantern_(Hal_Jordan),Secret Identity,Good Characters,Brown Eyes,Brown Hair,Male Characters,NaN,Living Characters,1565.0,"1959, October",1959.0
3,1659,James Gordon (New Earth),\/wiki\/James_Gordon_(New_Earth),Public Identity,Good Characters,Brown Eyes,White Hair,Male Characters,NaN,Living Characters,1316.0,"1987, February",1987.0
4,1576,Richard Grayson (New Earth),\/wiki\/Richard_Grayson_(New_Earth),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,1237.0,"1940, April",1940.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6891,66302,Nadine West (New Earth),\/wiki\/Nadine_West_(New_Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,NaN,Living Characters,NaN,NaN,NaN
6892,283475,Warren Harding (New Earth),\/wiki\/Warren_Harding_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6893,283478,William Harrison (New Earth),\/wiki\/William_Harrison_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6894,283471,William McKinley (New Earth),\/wiki\/William_McKinley_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6895,150660,Mookie (New Earth),\/wiki\/Mookie_(New_Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,NaN,Living Characters,NaN,NaN,NaN

Specifing column types:

In [65]:
pd.read_table(
  'data/dc-wikia-data.csv', 
  sep=',',
  dtype={
      'page_id': 'int', 
      'name': 'string',
      # ...
    }
  )

,page_id,name,urlslug,ID,ALIGN,EYE,HAIR,SEX,GSM,ALIVE,APPEARANCES,FIRST APPEARANCE,YEAR
0,1422,Batman (Bruce Wayne),\/wiki\/Batman_(Bruce_Wayne),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,3093.0,"1939, May",1939.0
1,23387,Superman (Clark Kent),\/wiki\/Superman_(Clark_Kent),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,2496.0,"1986, October",1986.0
2,1458,Green Lantern (Hal Jordan),\/wiki\/Green_Lantern_(Hal_Jordan),Secret Identity,Good Characters,Brown Eyes,Brown Hair,Male Characters,NaN,Living Characters,1565.0,"1959, October",1959.0
3,1659,James Gordon (New Earth),\/wiki\/James_Gordon_(New_Earth),Public Identity,Good Characters,Brown Eyes,White Hair,Male Characters,NaN,Living Characters,1316.0,"1987, February",1987.0
4,1576,Richard Grayson (New Earth),\/wiki\/Richard_Grayson_(New_Earth),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,1237.0,"1940, April",1940.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6891,66302,Nadine West (New Earth),\/wiki\/Nadine_West_(New_Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,NaN,Living Characters,NaN,NaN,NaN
6892,283475,Warren Harding (New Earth),\/wiki\/Warren_Harding_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6893,283478,William Harrison (New Earth),\/wiki\/William_Harrison_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6894,283471,William McKinley (New Earth),\/wiki\/William_McKinley_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6895,150660,Mookie (New Earth),\/wiki\/Mookie_(New_Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,NaN,Living Characters,NaN,NaN,NaN

Set all column names lowercase:

In [66]:
dc = dc.rename(columns = lambda x: x.lower())
dc

,page_id,name,urlslug,id,align,eye,hair,sex,gsm,alive,appearances,first appearance,year
0,1422,Batman (Bruce Wayne),\/wiki\/Batman_(Bruce_Wayne),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,3093.0,"1939, May",1939.0
1,23387,Superman (Clark Kent),\/wiki\/Superman_(Clark_Kent),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,2496.0,"1986, October",1986.0
2,1458,Green Lantern (Hal Jordan),\/wiki\/Green_Lantern_(Hal_Jordan),Secret Identity,Good Characters,Brown Eyes,Brown Hair,Male Characters,NaN,Living Characters,1565.0,"1959, October",1959.0
3,1659,James Gordon (New Earth),\/wiki\/James_Gordon_(New_Earth),Public Identity,Good Characters,Brown Eyes,White Hair,Male Characters,NaN,Living Characters,1316.0,"1987, February",1987.0
4,1576,Richard Grayson (New Earth),\/wiki\/Richard_Grayson_(New_Earth),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,1237.0,"1940, April",1940.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6891,66302,Nadine West (New Earth),\/wiki\/Nadine_West_(New_Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,NaN,Living Characters,NaN,NaN,NaN
6892,283475,Warren Harding (New Earth),\/wiki\/Warren_Harding_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6893,283478,William Harrison (New Earth),\/wiki\/William_Harrison_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6894,283471,William McKinley (New Earth),\/wiki\/William_McKinley_(New_Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6895,150660,Mookie (New Earth),\/wiki\/Mookie_(New_Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,NaN,Living Characters,NaN,NaN,NaN

## Base operations

### Simple selection

In [67]:
# select columns: name, appearances, sex
dc_2 = dc[['name', 'appearances', 'sex']]
dc_2

                              name  appearances                sex
0             Batman (Bruce Wayne)       3093.0    Male Characters
1            Superman (Clark Kent)       2496.0    Male Characters
2       Green Lantern (Hal Jordan)       1565.0    Male Characters
3         James Gordon (New Earth)       1316.0    Male Characters
4      Richard Grayson (New Earth)       1237.0    Male Characters
...                            ...          ...                ...
6891       Nadine West (New Earth)          NaN  Female Characters
6892    Warren Harding (New Earth)          NaN    Male Characters
6893  William Harrison (New Earth)          NaN    Male Characters
6894  William McKinley (New Earth)          NaN    Male Characters
6895            Mookie (New Earth)          NaN    Male Characters

[6896 rows x 3 columns]

### Simple row filter

In [68]:
# get the "Female Characters"
dc_2_female = dc_2[dc_2.sex == "Female Characters"]
dc_2_female

                                name  appearances                sex
5        Wonder Woman (Diana Prince)       1231.0  Female Characters
8     Dinah Laurel Lance (New Earth)       1075.0  Female Characters
10                        GenderTest       1028.0  Female Characters
12        Barbara Gordon (New Earth)        951.0  Female Characters
14             Lois Lane (New Earth)        934.0  Female Characters
...                              ...          ...                ...
6878       Dorothea Tane (New Earth)          NaN  Female Characters
6881          Doris Zuel (New Earth)          NaN  Female Characters
6882           Doris Lee (New Earth)          NaN  Female Characters
6885          Catwoman (Selina Kyle)          NaN  Female Characters
6891         Nadine West (New Earth)          NaN  Female Characters

[1967 rows x 3 columns]

### Pipe 

Two operations in one pipeline:

In [69]:
dc[['name', 'appearances', 'sex']][dc.sex == "Female Characters"]

                                name  appearances                sex
5        Wonder Woman (Diana Prince)       1231.0  Female Characters
8     Dinah Laurel Lance (New Earth)       1075.0  Female Characters
10                        GenderTest       1028.0  Female Characters
12        Barbara Gordon (New Earth)        951.0  Female Characters
14             Lois Lane (New Earth)        934.0  Female Characters
...                              ...          ...                ...
6878       Dorothea Tane (New Earth)          NaN  Female Characters
6881          Doris Zuel (New Earth)          NaN  Female Characters
6882           Doris Lee (New Earth)          NaN  Female Characters
6885          Catwoman (Selina Kyle)          NaN  Female Characters
6891         Nadine West (New Earth)          NaN  Female Characters

[1967 rows x 3 columns]

### Column Selections

#### Basic selections

In [70]:
# select a range (unmutable)
dc.loc[:,'name':'year'] 

# unselect (unmutable)
dc.drop(columns=['page_id', 'urlslug'])
# or (unmutable)
dc.drop(['page_id', 'urlslug'], axis=1)

,name,id,align,eye,hair,sex,gsm,alive,appearances,first appearance,year
0,Batman (Bruce Wayne),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,3093.0,"1939, May",1939.0
1,Superman (Clark Kent),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,2496.0,"1986, October",1986.0
2,Green Lantern (Hal Jordan),Secret Identity,Good Characters,Brown Eyes,Brown Hair,Male Characters,NaN,Living Characters,1565.0,"1959, October",1959.0
3,James Gordon (New Earth),Public Identity,Good Characters,Brown Eyes,White Hair,Male Characters,NaN,Living Characters,1316.0,"1987, February",1987.0
4,Richard Grayson (New Earth),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,1237.0,"1940, April",1940.0
...,...,...,...,...,...,...,...,...,...,...,...
6891,Nadine West (New Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,NaN,Living Characters,NaN,NaN,NaN
6892,Warren Harding (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6893,William Harrison (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6894,William McKinley (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,NaN,Living Characters,NaN,NaN,NaN
6895,Mookie (New Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,NaN,Living Characters,NaN,NaN,NaN

In [71]:
# rename 'id' to 'secret_id' (unmutable because 'inplace'=False, dc has changed because of the assignation)
dc = dc.rename(columns={'id': 'secret_id'}, inplace=False)
dc[['name', 'secret_id']]

                              name        secret_id
0             Batman (Bruce Wayne)  Secret Identity
1            Superman (Clark Kent)  Secret Identity
2       Green Lantern (Hal Jordan)  Secret Identity
3         James Gordon (New Earth)  Public Identity
4      Richard Grayson (New Earth)  Secret Identity
...                            ...              ...
6891       Nadine West (New Earth)  Public Identity
6892    Warren Harding (New Earth)  Public Identity
6893  William Harrison (New Earth)  Public Identity
6894  William McKinley (New Earth)  Public Identity
6895            Mookie (New Earth)  Public Identity

[6896 rows x 2 columns]

NB: `inplace=False` means not to change the data frame, but to push changes in the result only (immutable method).

#### Name matching (filter)

Select matching columns with [filter](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.filter.html)

In [72]:
# all column names
dc.columns

Index(['page_id', 'name', 'urlslug', 'secret_id', 'align', 'eye', 'hair',
       'sex', 'gsm', 'alive', 'appearances', 'first appearance', 'year'],
      dtype='object')

In [73]:
# select columns by name
dc.filter(items=['name', 'first appearance', 'appearances'])

# select columns containing 'appearance' as sub-string
dc.filter(like='appearance', axis=1)

      appearances first appearance
0          3093.0        1939, May
1          2496.0    1986, October
2          1565.0    1959, October
3          1316.0   1987, February
4          1237.0      1940, April
...           ...              ...
6891          NaN              NaN
6892          NaN              NaN
6893          NaN              NaN
6894          NaN              NaN
6895          NaN              NaN

[6896 rows x 2 columns]

Use [Regular-expressions](https://en.wikipedia.org/wiki/Regular_expression) (regex)

In [74]:
# begin with a specific string
dc.filter(regex='^appearance', axis=1)
# end with a specific string
dc.filter(regex='appearance$', axis=1)

     first appearance
0           1939, May
1       1986, October
2       1959, October
3      1987, February
4         1940, April
...               ...
6891              NaN
6892              NaN
6893              NaN
6894              NaN
6895              NaN

[6896 rows x 1 columns]

NB: the `^` and `$` signs in a regular expression mean respectively the begin and the end of the string.

In [75]:
# Any pattern you can create with a regex
dc.filter(regex='s.+_id$', axis=1)

            secret_id
0     Secret Identity
1     Secret Identity
2     Secret Identity
3     Public Identity
4     Secret Identity
...               ...
6891  Public Identity
6892  Public Identity
6893  Public Identity
6894  Public Identity
6895  Public Identity

[6896 rows x 1 columns]

#### Select by type

In [76]:
# Select all numeric fields
dc.select_dtypes(np.number).head()

# Select all real fields
dc.select_dtypes('float64').head()

# Select all integer fields
dc.select_dtypes('int64').head()

# Exclude strings
dc.select_dtypes(exclude='string').head()

,page_id,name,urlslug,secret_id,align,eye,hair,sex,gsm,alive,appearances,first appearance,year
0,1422,Batman (Bruce Wayne),\/wiki\/Batman_(Bruce_Wayne),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,3093.0,"1939, May",1939.0
1,23387,Superman (Clark Kent),\/wiki\/Superman_(Clark_Kent),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,2496.0,"1986, October",1986.0
2,1458,Green Lantern (Hal Jordan),\/wiki\/Green_Lantern_(Hal_Jordan),Secret Identity,Good Characters,Brown Eyes,Brown Hair,Male Characters,NaN,Living Characters,1565.0,"1959, October",1959.0
3,1659,James Gordon (New Earth),\/wiki\/James_Gordon_(New_Earth),Public Identity,Good Characters,Brown Eyes,White Hair,Male Characters,NaN,Living Characters,1316.0,"1987, February",1987.0
4,1576,Richard Grayson (New Earth),\/wiki\/Richard_Grayson_(New_Earth),Secret Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,NaN,Living Characters,1237.0,"1940, April",1940.0

### Unique values

In [77]:
# Unique values of a column
dc.sex.unique()
# Count of those unique values
dc.sex.nunique()
dc.sex.nunique(dropna = False)

5

In [78]:
# this does not work:
#dc[['secret_id','sex']].unique()

### Row Filter

In [79]:
dc_simple = dc.drop(columns=['page_id', 'urlslug'])[['name', 'appearances', 'sex', 'hair']]
dc_simple

                              name  appearances                sex        hair
0             Batman (Bruce Wayne)       3093.0    Male Characters  Black Hair
1            Superman (Clark Kent)       2496.0    Male Characters  Black Hair
2       Green Lantern (Hal Jordan)       1565.0    Male Characters  Brown Hair
3         James Gordon (New Earth)       1316.0    Male Characters  White Hair
4      Richard Grayson (New Earth)       1237.0    Male Characters  Black Hair
...                            ...          ...                ...         ...
6891       Nadine West (New Earth)          NaN  Female Characters         NaN
6892    Warren Harding (New Earth)          NaN    Male Characters         NaN
6893  William Harrison (New Earth)          NaN    Male Characters         NaN
6894  William McKinley (New Earth)          NaN    Male Characters         NaN
6895            Mookie (New Earth)          NaN    Male Characters  Blond Hair

[6896 rows x 4 columns]

Simple filter:

In [80]:
# get the "Female Characters"
dc_simple[dc_simple.sex == 'Female Characters'].head()

                              name  appearances                sex        hair
5      Wonder Woman (Diana Prince)       1231.0  Female Characters  Black Hair
8   Dinah Laurel Lance (New Earth)       1075.0  Female Characters  Blond Hair
10                      GenderTest       1028.0  Female Characters  Blond Hair
12      Barbara Gordon (New Earth)        951.0  Female Characters    Red Hair
14           Lois Lane (New Earth)        934.0  Female Characters  Black Hair

In [81]:
# match multiple conditions (all of them)
# get the "Female Characters" AND with 'Blond Hair'
dc_simple[dc_simple.sex.eq('Female Characters') & dc_simple.hair.eq('Blond Hair')].head()

,name,appearances,sex,hair
8,Dinah Laurel Lance (New Earth),1075.0,Female Characters,Blond Hair
10,GenderTest,1028.0,Female Characters,Blond Hair
21,Kara Zor-L (Earth-Two),635.0,Female Characters,Blond Hair
38,Cassandra Sandsmark (New Earth),423.0,Female Characters,Blond Hair
67,Courtney Whitmore (New Earth),305.0,Female Characters,Blond Hair

In [82]:
# Match one of the alternatives (any of them)
# get the "Female Characters" OR with 'Blond Hair'
dc_simple[dc_simple.sex.eq('Female Characters') | dc_simple.hair.eq('Blond Hair')].head()

                              name  appearances                sex        hair
5      Wonder Woman (Diana Prince)       1231.0  Female Characters  Black Hair
6           Aquaman (Arthur Curry)       1121.0    Male Characters  Blond Hair
8   Dinah Laurel Lance (New Earth)       1075.0  Female Characters  Blond Hair
9              Flash (Barry Allen)       1028.0    Male Characters  Blond Hair
10                      GenderTest       1028.0  Female Characters  Blond Hair

In [83]:
# Conditions on numbers
# Example: 
# get characters that appeared a greater or equal number of times than 1000 
dc_simple[dc_simple.appearances >= 1000]

                              name  appearances                sex        hair
0             Batman (Bruce Wayne)       3093.0    Male Characters  Black Hair
1            Superman (Clark Kent)       2496.0    Male Characters  Black Hair
2       Green Lantern (Hal Jordan)       1565.0    Male Characters  Brown Hair
3         James Gordon (New Earth)       1316.0    Male Characters  White Hair
4      Richard Grayson (New Earth)       1237.0    Male Characters  Black Hair
5      Wonder Woman (Diana Prince)       1231.0  Female Characters  Black Hair
6           Aquaman (Arthur Curry)       1121.0    Male Characters  Blond Hair
7        Timothy Drake (New Earth)       1095.0    Male Characters  Black Hair
8   Dinah Laurel Lance (New Earth)       1075.0  Female Characters  Blond Hair
9              Flash (Barry Allen)       1028.0    Male Characters  Blond Hair
10                      GenderTest       1028.0  Female Characters  Blond Hair

In [84]:
# Example: 
# within a given interval (inclusive)
dc_simple[(900 <= dc_simple.appearances) & (dc_simple.appearances <= 1000)]
# or (equivalent)
dc_simple[ dc_simple.appearances.between(900, 1000, inclusive=True) ]

                             name  appearances                sex        hair
11         Alan Scott (New Earth)        969.0    Male Characters  Blond Hair
12     Barbara Gordon (New Earth)        951.0  Female Characters    Red Hair
13      Jason Garrick (New Earth)        951.0    Male Characters  Brown Hair
14          Lois Lane (New Earth)        934.0  Female Characters  Black Hair
15  Alfred Pennyworth (New Earth)        930.0    Male Characters  Black Hair

In [85]:
# Example: 
# outside a given interval
dc_simple[ (dc_simple.appearances < 900) | (1000 < dc_simple.appearances) ]
# or (NB: non equivalent relating to NaN)
dc_simple[ ~ dc_simple.appearances.between(900, 1000, inclusive=True) ]

                              name  appearances                sex        hair
0             Batman (Bruce Wayne)       3093.0    Male Characters  Black Hair
1            Superman (Clark Kent)       2496.0    Male Characters  Black Hair
2       Green Lantern (Hal Jordan)       1565.0    Male Characters  Brown Hair
3         James Gordon (New Earth)       1316.0    Male Characters  White Hair
4      Richard Grayson (New Earth)       1237.0    Male Characters  Black Hair
...                            ...          ...                ...         ...
6891       Nadine West (New Earth)          NaN  Female Characters         NaN
6892    Warren Harding (New Earth)          NaN    Male Characters         NaN
6893  William Harrison (New Earth)          NaN    Male Characters         NaN
6894  William McKinley (New Earth)          NaN    Male Characters         NaN
6895            Mookie (New Earth)          NaN    Male Characters  Blond Hair

[6891 rows x 4 columns]

In [86]:
# set-in operator

# Example: 
# 'appearances' has a value in a vector of possible real numbers
dc_simple[ dc_simple.appearances.isin([900, 1316]) ] 
# Advice: the 'isin' method should be read as the 'is in' method

                       name  appearances              sex        hair
3  James Gordon (New Earth)       1316.0  Male Characters  White Hair

[is-in-operator](https://pandas.pydata.org/docs/reference/api/pandas.Series.isin.html)

In [87]:
# Example: 
# 'hair' has a value in a vector of possible strings
dc_simple[ dc_simple.hair.isin(['Violet Hair', 'Pink Hair']) ]

,name,appearances,sex,hair
743,Brainiac 8 (New Earth),38.0,Female Characters,Pink Hair
987,Susan Linden I (New Earth),28.0,Female Characters,Violet Hair
1009,Flora Black (New Earth),27.0,Female Characters,Violet Hair
1780,Susan Linden II (New Earth),14.0,Female Characters,Violet Hair
1959,Silica (New Earth),12.0,Female Characters,Pink Hair
1979,Fay Moffit (New Earth),12.0,Female Characters,Pink Hair
2373,Vanessa Kingsbury (New Earth),10.0,Female Characters,Pink Hair
2559,Gretti (New Earth),9.0,Male Characters,Violet Hair
2865,Poprocket (New Earth),7.0,Female Characters,Pink Hair
2910,Venizz (New Earth),7.0,Female Characters,Pink Hair
4963,Eduardo Flamingo (New Earth),2.0,Male Characters,Pink Hair
5002,Vera Klopis (New Earth),2.0,Female Characters,Pink Hair
6028,Hoppy (New Earth),1.0,Male Characters,Pink Hair
6037,Millie (New Earth),1.0,Female Characters,Pink Hair
6699,B'aad (New Earth),NaN,Male Characters,Pink Hair

### Sampling

In [88]:
# take rows by their position index
dc_simple.iloc[5:10]

                             name  appearances                sex        hair
5     Wonder Woman (Diana Prince)       1231.0  Female Characters  Black Hair
6          Aquaman (Arthur Curry)       1121.0    Male Characters  Blond Hair
7       Timothy Drake (New Earth)       1095.0    Male Characters  Black Hair
8  Dinah Laurel Lance (New Earth)       1075.0  Female Characters  Blond Hair
9             Flash (Barry Allen)       1028.0    Male Characters  Blond Hair

[Sample Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sample.html)

In [89]:
# Extract a sample of 'n' lines
dc_simple.sample(n=3)

# Extract a fraction of all lines
dc_simple.sample(frac=0.1).head()

# Re-sample repeating lines
dc_simple.sample(frac=1.5, replace=True).head()

# if you want to fix the random state of the random sampling
dc_simple.sample(n=3, random_state=123)

                                name  appearances              sex        hair
6690        Nameless One (New Earth)          NaN  Male Characters  White Hair
3850  Dead Hand Legendre (New Earth)          4.0  Male Characters         NaN
6312           Snowflame (New Earth)          1.0  Male Characters  White Hair

In [90]:
#waited sampling
#dc_simple.sample(n=3,  weights='weight number column')

### Row sorting

Reference: [sort_values](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html) documentation.

Sort using a column as a criteria:

In [91]:

# sort by one column
dc_simple.sort_values(by='appearances')
# sort by one column in descending order
dc_simple.sort_values(by='appearances', ascending=False)
# set the na position
dc_simple.sort_values(by='appearances', ascending=False, na_position='first')

                             name  appearances                sex         hair
6541  Matteo Bischoff (New Earth)          NaN    Male Characters    Grey Hair
6542       Doomslayer (New Earth)          NaN    Male Characters   White Hair
6543       Emily Sung (New Earth)          NaN  Female Characters  Purple Hair
6544           Ry'jll (New Earth)          NaN  Female Characters          NaN
6545    Baron Gestapo (New Earth)          NaN    Male Characters          NaN
...                           ...          ...                ...          ...
5877          Scratch (New Earth)          1.0    Male Characters     Red Hair
5878      Sheila Carr (New Earth)          1.0  Female Characters   Black Hair
5879       Steel Fang (New Earth)          1.0    Male Characters          NaN
5880           Althea (New Earth)          1.0  Female Characters   Brown Hair
6540    Auctioneer II (New Earth)          1.0    Male Characters   White Hair

[6896 rows x 4 columns]

In [92]:
# sort by two criteria (the first has the precedence)
dc_simple.sort_values(by=['sex', 'appearances'], ascending=[True, False])[['sex', 'appearances']]

                    sex  appearances
5     Female Characters       1231.0
8     Female Characters       1075.0
10    Female Characters       1028.0
12    Female Characters        951.0
14    Female Characters        934.0
...                 ...          ...
6680                NaN          NaN
6731                NaN          NaN
6736                NaN          NaN
6835                NaN          NaN
6854                NaN          NaN

[6896 rows x 2 columns]

## Transform columns

### Create a new column

In [93]:
dc.assign(age = 2021 - dc.year)[['name', 'year', 'age']]

                              name    year   age
0             Batman (Bruce Wayne)  1939.0  82.0
1            Superman (Clark Kent)  1986.0  35.0
2       Green Lantern (Hal Jordan)  1959.0  62.0
3         James Gordon (New Earth)  1987.0  34.0
4      Richard Grayson (New Earth)  1940.0  81.0
...                            ...     ...   ...
6891       Nadine West (New Earth)     NaN   NaN
6892    Warren Harding (New Earth)     NaN   NaN
6893  William Harrison (New Earth)     NaN   NaN
6894  William McKinley (New Earth)     NaN   NaN
6895            Mookie (New Earth)     NaN   NaN

[6896 rows x 3 columns]

In [94]:
from nycflights13 import flights

In [95]:
flights[['dep_delay', 'arr_delay']]\
  .assign(time_gain = flights.dep_delay - flights.arr_delay)

        dep_delay  arr_delay  time_gain
0             2.0       11.0       -9.0
1             4.0       20.0      -16.0
2             2.0       33.0      -31.0
3            -1.0      -18.0       17.0
4            -6.0      -25.0       19.0
...           ...        ...        ...
336771        NaN        NaN        NaN
336772        NaN        NaN        NaN
336773        NaN        NaN        NaN
336774        NaN        NaN        NaN
336775        NaN        NaN        NaN

[336776 rows x 3 columns]

### Segment data values into bins

In order to create a categorical variable from a continuous variable you need to segment and sort data values into bins.

You can do that with the [pandas.cut](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html) function:

#### Example 1: split a variable into equal intervals

Here a `cut` example. `cut` splits a variable in classes, each of them correspond to an interval of values.

You can automatically split the range of `year` in a number of classes:

In [96]:
# You can automatically split the range of `year` in a number of classes:
dc[['year']]\
  .assign(year_class = pd.cut(dc.year, bins = 10))

        year          year_class
0     1939.0  (1934.922, 1942.8]
1     1986.0    (1981.8, 1989.6]
2     1959.0    (1958.4, 1966.2]
3     1987.0    (1981.8, 1989.6]
4     1940.0  (1934.922, 1942.8]
...      ...                 ...
6891     NaN                 NaN
6892     NaN                 NaN
6893     NaN                 NaN
6894     NaN                 NaN
6895     NaN                 NaN

[6896 rows x 2 columns]

Or you can provide a set of separators (`breaks`) and labels for the intervals. Mind the number of breaks should be one more than the labels.

In [97]:
# separa le classi sulla variabile separatori e attribuisci la corretta etichetta.
breaks = np.arange(0,10) * 10 + 1900
labels = np.vectorize(str)(np.arange(0,9) * 10) # 'years'
# You can automatically split the range of `year` in a number of classes:
dc[['year']]\
  .assign(year_class = pd.cut(
    x=dc.year, 
    bins=breaks,
    labels=labels
  )
)

        year year_class
0     1939.0         30
1     1986.0         80
2     1959.0         50
3     1987.0         80
4     1940.0         30
...      ...        ...
6891     NaN        NaN
6892     NaN        NaN
6893     NaN        NaN
6894     NaN        NaN
6895     NaN        NaN

[6896 rows x 2 columns]

Detail. Here an extract of the procedure, the cut function applied on a single number:

In [98]:
pd.cut(pd.Series([1939]),
       bins=breaks, 
       labels=labels)

# 1939 in in the interval between the 4th and 5th breaks
pd.Series([1939]).between(breaks[3], breaks[4])

# the selected labels will be the 4th
labels[3]

'30'

#### Example 2: split a variable into customized intervals

In [99]:
flights[['arr_delay']].assign(
    delay_class=pd.cut(
        x=flights['arr_delay'],
        bins=  [ -np.inf,         0,                15,             np.inf],
        labels=[       'no-delay',    'small-delay',    'big-delay']
    )
)

        arr_delay  delay_class
0            11.0  small-delay
1            20.0    big-delay
2            33.0    big-delay
3           -18.0     no-delay
4           -25.0     no-delay
...           ...          ...
336771        NaN          NaN
336772        NaN          NaN
336773        NaN          NaN
336774        NaN          NaN
336775        NaN          NaN

[336776 rows x 2 columns]

## Aggregate rows

### Scalar-returning aggregations

`summarise` works with functions that return a scalar:

$$
R^n -> R
$$

R^n -> R

For example, the `mean` function take a vector and returns a single value:

In [100]:
np.mean(flights.arr_delay)

6.89537675731489

Examples:

- [numpy.mean](https://numpy.org/doc/stable/reference/generated/numpy.mean.html)
- [numpy.std](https://numpy.org/doc/stable/reference/generated/numpy.std.html)
- [numpy.quantile](https://numpy.org/doc/stable/reference/generated/numpy.quantile.html)

- [pandas.Series.max](https://pandas.pydata.org/docs/reference/api/pandas.Series.max.html)
- [pandas.Series.min](https://pandas.pydata.org/docs/reference/api/pandas.Series.min.html)

### Aggregate to a scalar

Prepare the dataset:

In [101]:
flights_tiny = flights[[ 'dep_delay', 'arr_delay', 'carrier', 'origin', 'dest' ]]
flights_tiny

        dep_delay  arr_delay carrier origin dest
0             2.0       11.0      UA    EWR  IAH
1             4.0       20.0      UA    LGA  IAH
2             2.0       33.0      AA    JFK  MIA
3            -1.0      -18.0      B6    JFK  BQN
4            -6.0      -25.0      DL    LGA  ATL
...           ...        ...     ...    ...  ...
336771        NaN        NaN      9E    JFK  DCA
336772        NaN        NaN      9E    LGA  SYR
336773        NaN        NaN      MQ    LGA  BNA
336774        NaN        NaN      MQ    LGA  CLE
336775        NaN        NaN      MQ    LGA  RDU

[336776 rows x 5 columns]

Calculate a single aggregation:

In [102]:
flights_tiny.agg({
    'arr_delay': np.mean,
  })

arr_delay    6.895377
dtype: float64

Calculate multiple aggregations:

In [103]:
flights_tiny.aggregate({
  'dep_delay': [np.mean, np.std, np.median],
  'arr_delay': [np.mean, np.std, np.median],
})

        dep_delay  arr_delay
mean    12.639070   6.895377
std     40.210061  44.633292
median  -2.000000  -5.000000

In [104]:
def second_quartile(x):
  return np.nanquantile(x, 0.5)
  
# flights_tiny.aggregate({
#     'arr_delay': np.quantile,
#   },
#   q=0.5
# )


# flights_tiny.arr_delay.aggregate([second_quartile])
# flights_tiny.arr_delay.aggregate(lambda x: np.nanquantile(x, 0.5))
flights.agg(lambda x: np.nanquantile(x['arr_delay'], 0.5))
# np.nanmedian(flights_tiny.arr_delay)
# np.nanquantile(flights_tiny.arr_delay, 0.5)
# second_quartile(flights_tiny.arr_delay)

KeyError: 'arr_delay'

In [ ]:
%%R
flights_tiny %>% 
  summarise(mean_arr_delay   = mean(arr_delay, na.rm = TRUE),
            sd_arr_delay     = sd(arr_delay, na.rm = TRUE),
            mean_dep_delay   = mean(dep_delay, na.rm = TRUE),
            median_arr_delay = median(arr_delay, na.rm = TRUE),
            first_quartile_arr_delay  = quantile(arr_delay, probs = 0.25, na.rm = TRUE),
            second_quartile_arr_delay = quantile(arr_delay, probs = 0.5, na.rm = TRUE))

## Compute per groups

### Aggregation per groups

In [ ]:
flights_tiny\
  .groupby('carrier')\
  .aggregate({
    'dep_delay': [np.mean, np.std, np.median],
    'arr_delay': [np.mean, np.std, np.median],
  })

## A

### Joins

Let us a couple of example tables. Let us define a [foreign-key](https://en.wikipedia.org/wiki/Foreign_key) a column whose values have a correspondence in another table. This creates a relationship among two tables.

In [ ]:
letters = np.array(list("abcdefghijklmnopqrstuvwxyz"))
letters
upper_letters = np.vectorize(lambda x: x.upper())(letters)
upper_letters

`DataFrame` joins are performed with the function  [merge](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html).

In [ ]:
# Main table, where
# 'id' id number
# 'lower' a foreign key
main_tbl = pd.DataFrame({
  'id': np.arange(5),
  'lower': np.concatenate((letters[0:2], np.array(['a-non-letter']), letters[3:5]))
})
main_tbl

And another that contains (usually all) the occurrences of the foreign-key:

In [ ]:
# The table of letters 
# 'lower' list all the lower case letters
# 'upper' an attribute to the letters, for the example case a upper case copy of the letter
letter_tbl = pd.DataFrame({
  'lower': letters,
  'upper': upper_letters
})
letter_tbl

In [ ]:
# full-join
main_tbl.merge(letter_tbl, how='outer')

In [ ]:
# inner-join
main_tbl.merge(letter_tbl, how='inner')

In [ ]:
# left-join
main_tbl.merge(letter_tbl, how='left')

In [ ]:
# right-join
main_tbl.merge(letter_tbl, how='right')

# inverting the order a `right_join` return the same as a `left_join`
letter_tbl.merge(main_tbl, how='left')

### Unite data frames

#### Concatenate rows

Example from the [guide](https://pandas.pydata.org/docs/user_guide/merging.html):

In [ ]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)

df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[0, 1, 2, 3],
)

df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[0, 1, 2, 3],
)

In [ ]:
# concat rows
pd.concat([df1, df2, df3])

In [ ]:
# bind columns by their index
pd.concat([df1, df2, df3], axis=1)